Revit 2027 API
MultiServerService.GetActiveServerIds(Document) Method
 Returns Ids of the servers currently applicable to the given document for the service.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<Guid> GetActiveServerIds(
	Document document
)
Public Function GetActiveServerIds (
	document As Document
) As IList(Of Guid)
public:
IList<Guid>^ GetActiveServerIds(
	Document^ document
)
member GetActiveServerIds :
        document : Document -> IList<Guid>
Parameters
document Document
 The associated document.
Return Value
IList<Guid>
 A set of GUIDs of the document-applicable active servers; the list may be empty.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 The Ids would be of all the servers explicitly assigned to the specified document.
See Also
Reference
MultiServerService Class
GetActiveServerIds Overload
Autodesk.Revit.DB.ExternalService Namespace